In [1]:
#import pandas as pd
#df=pd.DataFrame({'name':['ravi','krishna','ajith'], 'age':['10','20','30']})
#write=pd.ExcelWriter('datascien.xlsx',engine='xlsxwriter')
#df.to_excel(write,sheet_name='Details')
#write.save()

In [2]:
import pandas as pd
df=pd.read_excel('desktop/kvskeerthan.xlsx',index_col='name') # index_col is different from set_index we can use only index_col while declaring in the excel sheet

In [3]:
df
# df.head() mention first 5 rows
#df.tail(10) mentions the last 10 columns

         age
name
krishna   22
sai       21
devi      23

In [4]:
df.shape
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, krishna to devi
Data columns (total 1 columns):
age    3 non-null int64
dtypes: int64(1)
memory usage: 48.0+ bytes

In [91]:
pd.set_option('display.max_column', 1)
#pd.set_option('display.max_row',3)
# it shows only one column

In [6]:
# schema shows what is the purpose of the data to be used
schema_df=pd.read_excel('desktop/kvskeerthan.xlsx')
schema_df

      name  age
0  krishna   22
1     sai    21
2     devi   23

In [7]:
# about data frames
import pandas as pd
people={'names':['ravi','kishore','sairam'],
         'age':['21','22','23']}
df=pd.DataFrame(people)
df

     names age
0     ravi  21
1  kishore  22
2   sairam  23

In [8]:
# or we can as df.age
df['age']
df[['age','names']]# for multiple of data to be passed

  age    names
0  21     ravi
1  22  kishore
2  23   sairam

In [9]:
df.columns

Index(['names', 'age'], dtype='object')

In [10]:
df.iloc[1]# it gives like rows answers
df.iloc[[0,1]]# passes multiple of data
df.iloc[[0,1],1]# if we need to pass and need a column

0    21
1    22
Name: age, dtype: object

In [11]:
df.loc[[0,1],['names','age']]

     names age
0     ravi  21
1  kishore  22

In [12]:
df['age'].value_counts()

22    1
21    1
23    1
Name: age, dtype: int64

In [13]:
df.loc[[0,1],'names'] # or dfd.loc[0:2,'names':'age']

0       ravi
1    kishore
Name: names, dtype: object

In [14]:
#df.set_index('names')
df.set_index('age',inplace=True)

In [15]:
df

       names
age
21      ravi
22   kishore
23    sairam

In [16]:
df.index

Index(['21', '22', '23'], dtype='object', name='age')

In [17]:
df.loc['22']

names    kishore
Name: 22, dtype: object

In [18]:
df.iloc[1]

names    kishore
Name: 22, dtype: object

In [19]:
df.reset_index(inplace=True)
df

  age    names
0  21     ravi
1  22  kishore
2  23   sairam

In [20]:
df.set_index('name',inplace=True)
df.sort_index()
#df.sort_index(ascending=False)

KeyError: 'name'

In [24]:
df.sort_index(ascending=False)

  age    names
2  23   sairam
1  22  kishore
0  21     ravi

In [26]:
filt=(df['age']=='21') & (df['names']=='ravi')

In [27]:
df[filt]

  age names
0  21  ravi

In [28]:
df.rename(columns={'names':'first_name','age':'ages'}, inplace=True)
df

  ages first_name
0   21       ravi
1   22    kishore
2   23     sairam

In [29]:
df.columns=df.columns.str.replace(' ','**')
df

  ages first_name
0   21       ravi
1   22    kishore
2   23     sairam

In [30]:
df.columns=[x.upper() for x in df.columns]
df

  AGES FIRST_NAME
0   21       ravi
1   22    kishore
2   23     sairam

In [31]:
filt=(df['AGES']=='22')
df.loc[filt,'AGES']='24'

In [32]:
df

  AGES FIRST_NAME
0   21       ravi
1   24    kishore
2   23     sairam

In [33]:
df.columns=[x.lower() for x in df.columns]
df

  ages first_name
0   21       ravi
1   24    kishore
2   23     sairam

In [36]:
#apply
#map
#applymap
#replace
df['first_name'].apply(len)

0    4
1    7
2    6
Name: first_name, dtype: int64

In [40]:
def updateages(first_name):
    return first_name.upper()

In [39]:
df['first_name'].apply(updateages)

0       RAVI
1    KISHORE
2     SAIRAM
Name: first_name, dtype: object

In [41]:
df['first_name']=df['first_name'].apply(updateages)

In [42]:
df

  ages first_name
0   21       RAVI
1   24    KISHORE
2   23     SAIRAM

In [44]:
df['first_name']=df['first_name'].apply(lambda x:x.lower())
df

  ages first_name
0   21       ravi
1   24    kishore
2   23     sairam

In [48]:
df.apply(len,axis='columns')

0    2
1    2
2    2
dtype: int64

In [50]:
len(df['ages'])

3

In [55]:
# capital S in series
df.apply(pd.Series.min)

ages               21
first_name    kishore
dtype: object

In [56]:
df.apply(lambda x:x.min())

ages               21
first_name    kishore
dtype: object

In [57]:
#applymap is used to say every thing in the table
df.applymap(len)

   ages  first_name
0     2           4
1     2           7
2     2           6

In [65]:
df.applymap(str.upper)

  ages first_name
0   21       RAVI
1   24    KISHORE
2   23     SAIRAM

In [61]:
df

  ages first_name
0   21       ravi
1   24    kishore
2   23     sairam

In [69]:
#map but it doesnot give the last value
df['first_name']=df['first_name'].map({'ravi':'sai','kishore':'sam'})
df

  ages first_name
0   21        sai
1   24        sam
2   23        NaN

In [73]:
df['first_name']=df['first_name'].replace({'sai':'ravi','sam':'kishore'})
df

  ages first_name
0   21       ravi
1   24    kishore
2   23        NaN

In [75]:
df.rename(columns={'ages':'age'},inplace=True)
df

  age first_name
0  21       ravi
1  24    kishore
2  23        NaN

In [76]:
query={'name':['kvs','hgdgd','lklkl'],'age':['12','13','122',],'email':['kbsads','jkasgsk','ajsgsg']}

In [77]:
qu=pd.DataFrame(query)
qu

    name  age    email
0    kvs   12   kbsads
1  hgdgd   13  jkasgsk
2  lklkl  122   ajsgsg

In [104]:
qu['name']+''+qu['age']

In [102]:
qu['fulname']=qu['name'] +' '+ qu['age']

In [105]:
pd.set_option('display.max_column',7)
qu

    name  age    email  fullname    fulname
0    kvs   12   kbsads     kvs12     kvs 12
1  hgdgd   13  jkasgsk   hgdgd13   hgdgd 13
2  lklkl  122   ajsgsg  lklkl122  lklkl 122

In [112]:
#qu.drop(columns=['name','age','fullname'])

KeyError: "['name' 'age' 'fullname'] not found in axis"

In [113]:
qu

     email    fulname
0   kbsads     kvs 12
1  jkasgsk   hgdgd 13
2   ajsgsg  lklkl 122